/**************************************************************
* Copyright (C) 2023 www.eipflow.com 孙泽伟版权所有(盗版必究)
*
* 作者: 孙泽伟(QQ 1039318332)
* 创建时间: 2018/10/30 22:40:15
* 文件名: 
* 描述: 
* 
* 修改历史
* 修改人：
* 时间：
* 修改说明：
*
**************************************************************/
namespace EIP.System.Models.Enums
{
    /// <summary>
    /// 数据权限转换
    /// </summary>
    public enum EnumPermissionRoteConvert
    {
        /// <summary>
        /// 人员数据权限
        /// </summary>
        人员列表数据权限,

        /// <summary>
        /// 人员列表组织结构数据权限
        /// </summary>
        人员列表组织结构数据权限,

        /// <summary>
        /// 组织机构数据权限
        /// </summary>
        组织机构数据权限,

        /// <summary>
        /// 角色数据权限
        /// </summary>
        角色列表数据权限,

        /// <summary>
        /// 角色列表组织结构数据权限
        /// </summary>
        角色列表组织结构数据权限,

        /// <summary>
        /// 岗位列表数据权限
        /// </summary>
        岗位列表数据权限,

        /// <summary>
        /// 岗位列表组织结构数据权限
        /// </summary>
        岗位列表组织结构数据权限,

        /// <summary>
        /// 组列表数据权限
        /// </summary>
        组列表数据权限,

        /// <summary>
        /// 组列表组织结构数据权限
        /// </summary>
        组列表组织结构数据权限,
    }
}