/**************************************************************
* Copyright (C) www.eipflow.com 孙泽伟版权所有(盗版必究)
*
* 作者: 孙泽伟(QQ 1039318332)
* 创建时间: 2018/10/30 22:40:15
* 文件名: 
* 描述: 
* 
* 修改历史
* 修改人：
* 时间：
* 修改说明：
*
**************************************************************/
namespace EIP.Workflow.Models.Enums
{
    /// <summary>
    /// 审批节点意见栏枚举:无审批意见栏,有审批意见需盖章,有审批意见无需盖章等
    /// </summary>
    public enum EnumActivityCommentsBelow
    {
        /// <summary>
        /// 
        /// </summary>
        无审批意见栏 = 2,
        /// <summary>
        /// 
        /// </summary>
        有审批意见需盖章 = 4,
        /// <summary>
        /// 
        /// </summary>
        有审批意见无需盖章 = 6
    }
}
